of222/tutorials/rheoFoam/CrossSlot/Oldroyd-BSqrt/0/b
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      b;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform (1 0 0 1 0 1);

boundaryField
{

    inlet_north
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 1);
    }
    inlet_south
    {
        type            fixedValue;
        value           uniform (1 0 0 1 0 1);
    }
    walls
    {     
        type            zeroGradient;
    }  
    outlet_west
    {
         type           zeroGradient;
    }
    outlet_east
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }

}

// ************************************************************************* //
