of222/tutorials/rheoFoam/CrossSlot/Oldroyd-BSqrt/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{
                
                type             Oldroyd-BSqrt;

                rho              rho [1 -3 0 0 0 0 0] 1;
                etaS             etaS [1 -1 -1 0 0 0 0] 0;
                etaP             etaP [1 -1 -1 0 0 0 0] 1;                 
                lambda           lambda [0 0 1 0 0 0 0] 0.33;  

                uTauCoupling     true;                
}

passiveScalarProperties
{
                solvePassiveScalar   on;
                D                    D [ 0 2 -1 0 0 0 0 ] 0.002; 
}

// ************************************************************************* //
